{
    "name": "Sri Vyasarajaru",
    "born": "1447 to 1539",
    "resting_place": "Nava Brundavana",
    "image": "Sri_Vyasarajaru.jpg",
    "more_info_1": "Sri Vyasa Tirtha, the scholar of Tattvavada is held in high esteem next to Sri Jayatirtha. His work has been to write detailed commentaries on the works of Srimad Ananda Tirtha and Sri Jayatirtha, and to show Tattvavada as being placed on a firm logical footing; his work is considered to be of the highest significance, particularly because it is accepted even by his opponents that his understanding of their schools is second to none. Thus, there is every possibility of claiming Sri Vyasa Tirtha’s critiques to be invalid on account of his having misstated the positions he wishes to criticize. Sri Vyasa Tirtha also keeps a tempo that is hard  for the less skilled to even conceive of, let alone match.His logic is exceptionally hard to beat, because of his uncanny knack of knowing exactly what the opponent is going to say, and using this information to lead the opponent on to traps of logic that are dozens of steps deep, and impossible to work through or around.One feels that while one gropes in the dark and tries to guess where one is and struggles to find one’ s way.",
    "more_info_2": "Sri Vyasa Tirtha not only knows one’ s present position to a nicety, he also knows all the possible ways one might proceed, in advance of oneself, and has a proper plan of action already planned out for any further move one might make. Thus, holding one’ s own in a debate with Sri Vyasa Tirtha is very similar to making one’ s way across a field laid with mines;one does not know where to put one’ s foot next, and very often, even a secure retreat to a former safe position is impossible, after one has taken a few steps down in hopes of making progress.In summation, it is hardly a stretch to say that Sri Vyasa Tirtha is the very personification of mastery of skill in dialogue and debate, that every logician and philosopher wishes to be.",
    "more_info_3": "In addition to his pellucid and luminescent writings, Sri Vyasa Tirtha is also known for the influence he had on the Vijayanagara empire, especially for the fact that it was under his tutelage that it had its heyday, and produced its greatest ruler.Perhaps even more importantly, it is noted that he was responsible for providing a healthy atmosphere in which the Hari - dasa tradition could sprout and flourish;he disregarded all highbrow disapprobation of the lower castes, as he showed by his acceptance of the low - caste Kanakadasa as a shishya, on par with his other students, and by his even arranging to prove to them that Kanakadasa was a greater devotee than any of them.An inauthentic biography of Sri Vyasa Tirtha can be found in the work Vyasayogicharita, by the Smarta poet Somanatha(Bangalore, 1926).The work however makes significant digressions from Tattvavada, for instance when at the very outset, it names Balarama as one of the avatars of Vishnu. However, the fact that such a work was even written by an adherent of another doctrine is an indicator of Sri Vyasa Tirtha’ s popularity even among his opponents.An authentic biography of Sri Vyasa Tirtha is the one by his immediate disciple Sri Srinivasa Tirtha.",
    "more_infor_4": "Sri Vyasa Tirtha was born in 1447 in Bannur which is in the Mysore district in the modern Karnataka state. He along with his brother and sister was born as a result of the blessings of Brahmanya Tirtha, and the young Yatiraja(the future Sri Vyasa Tirtha) was presented to Brahmanya Tirtha after he had completed a comprehensive study of subjects like kavya, nataka, alankara, and vyakarana. Having been impressed with the young Yatiraja’ s quick mind and great aptitude for learning, Brahmanya Tirtha secretly meditated to ordain him into the sanyasa order. Yatiraja, though respectful of his Guru, had his doubts about receiving such diksha, and finally consented after receiving a vision in which Vishnu himself instructed him not to try to avert his destiny.",
    "more_info_5": "Shortly after Yatiraja’ s ordination as Sri Vyasa Tirtha, Sri Vyasa Tirtha left for Kanchi and spent many years there studying the six systems of philosophy, and thus gave the finishing touches to his mastery of subjects like Advaita, Vishishtadvaita, and Navya - Nyaya, in addition to Tattvavada.After Kanchi, he continued his studies at Mulbagal under Sri Sripadarajaru.There he studied Vedanta for about five to six years.",
    "more_info_6": "He distinguished himself at the court of Saluva Narasimha at Chandragiri by winning several debates against renowned opponents.During this time, he was entrusted the worship of Lord Srinivasa at Tirupati, a task that he performed for twelve years, from 1486 - 1498. Sri Vyasa Tirtha left for Vijayanagara after persistent invitations by its royalty and ministers, and stayed there for the major part of the rest of his life.Among the several debates he had at Vijayanagara, a notable one was with Basava Bhatta of Kalinga which lasted for thirty days, before Basava Bhatta lost comprehensively.",
    "more_info_7": "However, the golden period of Sri Vyasa Tirtha’ s life started after Krishnadevaraya ascended the throne of Vijayanagara, for what were the one - and - twenty greatest years of the kingdom’ s history.Krishnadevaraya had a lot of regard for Sri Vyasa Tirtha, as is evident from the historical evidence that shows Krishnadevaraya regarded Sri Vyasa Tirtha as his Rajaguru.",
    "more_info_8": "Sri Vyasa Tirtha is responsible for the continuation of the high regard and recognition earned by the system started by Srimad Ananda Tirtha.He has been  respected by many scholars from other schools, including the likes of Appayya Dikshita, Pakshadhara Mishra, Madhusudana Sarasvati, and Basava Bhatta.He is known for his warm - heartedness and sympathy even towards proponents of other systems of philosophy, while being a staunch Madhwa himself.In fact, his elucidation of the principles of Advaita and Vishishtadvaita were so outstanding that he even had pupils of these doctrines, who learned those from him in preference to learning it from a guru in their  own tradition.Among his nine major works, his most important ones are Nyayamruta, Tarkatandava, and Chandrika, collectively known as Vyasa - Traya.",
    "more_info_9": "In his magnum opus Nyayamruta, he justifies the philosophy of Tattvavada and shows that Monism is untenable on every ground, and that the reality of the  world cannot be rejected, compromised, or diluted for any reason— physical, rational,or spiritual.The Tarkatandava is a refutation of the principles of Nyaya -  Vaisheshika.Tatparya - Chandrika, or Chandrika as it is known in short, is a commentary on Sri Jayatirtha’ s Tattvaprakashika and deals with the Sutra - Prasthana of  Tattvavada. It is, in fact, a significant contribution to the literature on the analysis of the Brahma - Sutra, because it makes an in -depth comparative study of the  Bhashyas of Shankara, Ramanuja, and Ananda Tirtha.",
    "more_info_10": " He has composed beautiful devotional songs in Kannada, thus contributing significantly to the Dasa - sahitya.He was also the Guru of Purandaradasa and  Kanakadasa, two outstanding luminaries of the Hari - Dasa tradition, the former also the founder of modern Carnatic music, and is probably the greatest singer - saint in history.Sri Vyasa Thirtha cast off his mortal body on the 8 th of March, 1539. His Brindavana is at Navabrindavana, which is located on an island in the Tungabhadra river, near Anegondi, very close to Hampi.Here, in the company of eight other eminent Madhwa ascetics, he continues to meditate, and to bless devotees with true knowledge.",
    "more_info_11": "Truly, Vyasa Tirtha was a complex personality who was a scholar par excellence, a statesman, under whose able guidance Vijayanagara empire achieved unprecedented prosperity and glory, a social reformer who encouraged the Dasakoota and the Bhakthi movement in Karnataka to reach the masses, including all subcastes and sects, a benefactor to the poor and needy and a great devotee of the Lord.His qualities are described very well in the Shloka:",
    "more_info_12": "Arthikalpitha kalpoyam Prathyarthi gajakesari |",
    "more_info_13": "Vyasatirtha gururbhuyath asmadishtartha siddhaye ||",
    "more_info_14": "For those who come to him as supplicants, he is the desire - tree granting all desires, he is like the lion who destroys elephants for his dialectical  opponents.May the great teacher, Vyasa Tirtha be our guide and protector, to grant all of our desires.",
    "charama_shloka": "12.mp3"
}